K6 Test Output.txt
         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: rentflow-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(90)<500' p(90)=125.3ms
    ✓ 'p(95)<800' p(95)=289.97ms
    ✓ 'p(99)<1500' p(99)=493.44ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 14016   451.354056/s
    checks_succeeded...: 100.00% 14016 out of 14016
    checks_failed......: 0.00%   0 out of 14016

    ✓ GET /buildings status 200
    ✓ GET /buildings/{id} status 200
    ✓ GET /units status 200
    ✓ GET /tenant status 200
    ✓ GET /charge/tenant status 200
    ✓ GET /charge-templates status 200

    HTTP
    http_req_duration..............: avg=49.29ms min=2.27ms med=12.78ms max=810.55ms p(90)=125.3ms p(95)=289.97ms
      { expected_response:true }...: avg=49.29ms min=2.27ms med=12.78ms max=810.55ms p(90)=125.3ms p(95)=289.97ms
    http_req_failed................: 0.00%  0 out of 14016
    http_reqs......................: 14016  451.354056/s

    EXECUTION
    iteration_duration.............: avg=1.29s   min=1.02s  med=1.08s   max=3.19s    p(90)=1.85s   p(95)=2.96s
    iterations.....................: 2336   75.225676/s
    vus............................: 9      min=9          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 9.1 MB 293 kB/s
    data_sent......................: 1.6 MB 52 kB/s



running (0m31.1s), 000/100 VUs, 2336 complete and 0 interrupted iterations
default ✓ [======================================] 100 VUs  30s